package leetcode_0406_根据身高重建队列

import (
	"sort"
)

/*
假设有打乱顺序的一群人站成一个队列。
每个人由一个整数对(h, k)表示，其中h是这个人的身高，k是排在这个人前面且身高大于或等于h的人数。
编写一个算法来重建这个队列。

注意：
总人数少于1100人。

示例
输入:
[[7,0], [4,4], [7,1], [5,0], [6,1], [5,2]]

输出:
[[5,0], [7,0], [5,2], [6,1], [4,4], [7,1]]

*/

/*
思考：
先按照个子从高到低排序，如果个子一样，则按照k从小到大排列，这样就得到了一个方便后面插入的队列
before: [[7,0] [4,4] [7,1] [5,0] [6,1] [5,2]]
after : [[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]]

得到了预处理的队列，然后遍历这个队列，按照k值来插入到队列的index位置
比如现在遍历到了[6 1], k = 1, 那么就插入到 index = 1 的位置
变成：[[7 0] [6 1] [7 1] [5 0] [5 2] [4 4]]
以此类推。。。

步骤分解：
原始输入：
[[7,0] [4,4] [7,1] [5,0] [6,1] [5,2]]
sort处理：
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]]
遍历people：
===== i=0
	↓：p[0] 应该在index=0的位置
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]]
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]] ok

===== i=1
		  ↓：p[1]应该在index=1的位置
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]]
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]] ok

===== i=2
			    ↓：p[2]应该在index=1的位置
[[7 0] [7 1] [6 1] [5 0] [5 2] [4 4]]
[[7 0] [6 1] [7 1] [5 0] [5 2] [4 4]] ok

===== i=3
					  ↓：p[3]应该在index=0的位置
[[7 0] [6 1] [7 1] [5 0] [5 2] [4 4]]
[[5 0] [7 0] [6 1] [7 1] [5 2] [4 4]] ok

===== i=4
							↓：p[4]应该在index=2的位置
[[5 0] [7 0] [6 1] [7 1] [5 2] [4 4]]
[[5 0] [7 0] [5 2] [6 1] [7 1] [4 4]] ok

===== i=5
								  ↓：p[5]应该在index=4的位置
[[5 0] [7 0] [5 2] [6 1] [7 1] [4 4]]
[[5 0] [7 0] [5 2] [6 1] [4 4] [7 1]] ok

最终结果：
[[5 0] [7 0] [5 2] [6 1] [4 4] [7 1]]
*/
func reconstructQueue(people [][]int) [][]int {
	// 排序，先按照身高h排序，如果身高一样高，那就按照人数k排序
	sort.Slice(people, func(i, j int) bool {
		return (people[i][0] > people[j][0]) || (people[i][0] == people[j][0] && people[i][1] < people[j][1])
	})

	// 按照k值插入到index=k的地方，index之后的往后移动
	for i, p := range people {
		people = append(people, p)
		copy(people[p[1]+1:i+1], people[p[1]:i+1])
		people[p[1]] = p
	}

	return people
}
